###################################################################

# Created by write_sdc on Mon Sep 23 11:36:37 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {score_A[7]}]
set_load -pin_load 0.05 [get_ports {score_A[6]}]
set_load -pin_load 0.05 [get_ports {score_A[5]}]
set_load -pin_load 0.05 [get_ports {score_A[4]}]
set_load -pin_load 0.05 [get_ports {score_A[3]}]
set_load -pin_load 0.05 [get_ports {score_A[2]}]
set_load -pin_load 0.05 [get_ports {score_A[1]}]
set_load -pin_load 0.05 [get_ports {score_A[0]}]
set_load -pin_load 0.05 [get_ports {score_B[7]}]
set_load -pin_load 0.05 [get_ports {score_B[6]}]
set_load -pin_load 0.05 [get_ports {score_B[5]}]
set_load -pin_load 0.05 [get_ports {score_B[4]}]
set_load -pin_load 0.05 [get_ports {score_B[3]}]
set_load -pin_load 0.05 [get_ports {score_B[2]}]
set_load -pin_load 0.05 [get_ports {score_B[1]}]
set_load -pin_load 0.05 [get_ports {score_B[0]}]
set_load -pin_load 0.05 [get_ports {result[1]}]
set_load -pin_load 0.05 [get_ports {result[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports {inning[1]}]
set_max_capacitance 0.15 [get_ports {inning[0]}]
set_max_capacitance 0.15 [get_ports half]
set_max_capacitance 0.15 [get_ports {action[2]}]
set_max_capacitance 0.15 [get_ports {action[1]}]
set_max_capacitance 0.15 [get_ports {action[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports {inning[1]}]
set_max_fanout 10 [get_ports {inning[0]}]
set_max_fanout 10 [get_ports half]
set_max_fanout 10 [get_ports {action[2]}]
set_max_fanout 10 [get_ports {action[1]}]
set_max_fanout 10 [get_ports {action[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports {inning[1]}]
set_max_transition 3 [get_ports {inning[0]}]
set_max_transition 3 [get_ports half]
set_max_transition 3 [get_ports {action[2]}]
set_max_transition 3 [get_ports {action[1]}]
set_max_transition 3 [get_ports {action[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 5  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 5  [get_ports {inning[1]}]
set_input_delay -clock clk  -min 0  [get_ports {inning[1]}]
set_input_delay -clock clk  -max 5  [get_ports {inning[0]}]
set_input_delay -clock clk  -min 0  [get_ports {inning[0]}]
set_input_delay -clock clk  -max 5  [get_ports half]
set_input_delay -clock clk  -min 0  [get_ports half]
set_input_delay -clock clk  -max 5  [get_ports {action[2]}]
set_input_delay -clock clk  -min 0  [get_ports {action[2]}]
set_input_delay -clock clk  -max 5  [get_ports {action[1]}]
set_input_delay -clock clk  -min 0  [get_ports {action[1]}]
set_input_delay -clock clk  -max 5  [get_ports {action[0]}]
set_input_delay -clock clk  -min 0  [get_ports {action[0]}]
set_output_delay -clock clk  -max 5  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 5  [get_ports {score_A[7]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[7]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[6]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[6]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[5]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[5]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[4]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[4]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[3]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[3]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[2]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[2]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[1]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[1]}]
set_output_delay -clock clk  -max 5  [get_ports {score_A[0]}]
set_output_delay -clock clk  -min 0  [get_ports {score_A[0]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[7]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[7]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[6]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[6]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[5]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[5]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[4]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[4]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[3]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[3]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[2]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[2]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[1]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[1]}]
set_output_delay -clock clk  -max 5  [get_ports {score_B[0]}]
set_output_delay -clock clk  -min 0  [get_ports {score_B[0]}]
set_output_delay -clock clk  -max 5  [get_ports {result[1]}]
set_output_delay -clock clk  -min 0  [get_ports {result[1]}]
set_output_delay -clock clk  -max 5  [get_ports {result[0]}]
set_output_delay -clock clk  -min 0  [get_ports {result[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports {inning[1]}]
set_input_transition -min 0.5  [get_ports {inning[1]}]
set_input_transition -max 0.5  [get_ports {inning[0]}]
set_input_transition -min 0.5  [get_ports {inning[0]}]
set_input_transition -max 0.5  [get_ports half]
set_input_transition -min 0.5  [get_ports half]
set_input_transition -max 0.5  [get_ports {action[2]}]
set_input_transition -min 0.5  [get_ports {action[2]}]
set_input_transition -max 0.5  [get_ports {action[1]}]
set_input_transition -min 0.5  [get_ports {action[1]}]
set_input_transition -max 0.5  [get_ports {action[0]}]
set_input_transition -min 0.5  [get_ports {action[0]}]
