###################################################################

# Created by write_sdc on Sun Oct 13 21:49:29 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_mode top
set_wire_load_model -name G5K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports out_value]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports in_valid2]
set_max_capacitance 0.15 [get_ports {image[7]}]
set_max_capacitance 0.15 [get_ports {image[6]}]
set_max_capacitance 0.15 [get_ports {image[5]}]
set_max_capacitance 0.15 [get_ports {image[4]}]
set_max_capacitance 0.15 [get_ports {image[3]}]
set_max_capacitance 0.15 [get_ports {image[2]}]
set_max_capacitance 0.15 [get_ports {image[1]}]
set_max_capacitance 0.15 [get_ports {image[0]}]
set_max_capacitance 0.15 [get_ports {template[7]}]
set_max_capacitance 0.15 [get_ports {template[6]}]
set_max_capacitance 0.15 [get_ports {template[5]}]
set_max_capacitance 0.15 [get_ports {template[4]}]
set_max_capacitance 0.15 [get_ports {template[3]}]
set_max_capacitance 0.15 [get_ports {template[2]}]
set_max_capacitance 0.15 [get_ports {template[1]}]
set_max_capacitance 0.15 [get_ports {template[0]}]
set_max_capacitance 0.15 [get_ports {image_size[1]}]
set_max_capacitance 0.15 [get_ports {image_size[0]}]
set_max_capacitance 0.15 [get_ports {action[2]}]
set_max_capacitance 0.15 [get_ports {action[1]}]
set_max_capacitance 0.15 [get_ports {action[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports in_valid2]
set_max_fanout 10 [get_ports {image[7]}]
set_max_fanout 10 [get_ports {image[6]}]
set_max_fanout 10 [get_ports {image[5]}]
set_max_fanout 10 [get_ports {image[4]}]
set_max_fanout 10 [get_ports {image[3]}]
set_max_fanout 10 [get_ports {image[2]}]
set_max_fanout 10 [get_ports {image[1]}]
set_max_fanout 10 [get_ports {image[0]}]
set_max_fanout 10 [get_ports {template[7]}]
set_max_fanout 10 [get_ports {template[6]}]
set_max_fanout 10 [get_ports {template[5]}]
set_max_fanout 10 [get_ports {template[4]}]
set_max_fanout 10 [get_ports {template[3]}]
set_max_fanout 10 [get_ports {template[2]}]
set_max_fanout 10 [get_ports {template[1]}]
set_max_fanout 10 [get_ports {template[0]}]
set_max_fanout 10 [get_ports {image_size[1]}]
set_max_fanout 10 [get_ports {image_size[0]}]
set_max_fanout 10 [get_ports {action[2]}]
set_max_fanout 10 [get_ports {action[1]}]
set_max_fanout 10 [get_ports {action[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports in_valid2]
set_max_transition 3 [get_ports {image[7]}]
set_max_transition 3 [get_ports {image[6]}]
set_max_transition 3 [get_ports {image[5]}]
set_max_transition 3 [get_ports {image[4]}]
set_max_transition 3 [get_ports {image[3]}]
set_max_transition 3 [get_ports {image[2]}]
set_max_transition 3 [get_ports {image[1]}]
set_max_transition 3 [get_ports {image[0]}]
set_max_transition 3 [get_ports {template[7]}]
set_max_transition 3 [get_ports {template[6]}]
set_max_transition 3 [get_ports {template[5]}]
set_max_transition 3 [get_ports {template[4]}]
set_max_transition 3 [get_ports {template[3]}]
set_max_transition 3 [get_ports {template[2]}]
set_max_transition 3 [get_ports {template[1]}]
set_max_transition 3 [get_ports {template[0]}]
set_max_transition 3 [get_ports {image_size[1]}]
set_max_transition 3 [get_ports {image_size[0]}]
set_max_transition 3 [get_ports {action[2]}]
set_max_transition 3 [get_ports {action[1]}]
set_max_transition 3 [get_ports {action[0]}]
create_clock [get_ports clk]  -period 11.3  -waveform {0 5.65}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 5.65  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 5.65  [get_ports in_valid2]
set_input_delay -clock clk  -min 0  [get_ports in_valid2]
set_input_delay -clock clk  -max 5.65  [get_ports {image[7]}]
set_input_delay -clock clk  -min 0  [get_ports {image[7]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[6]}]
set_input_delay -clock clk  -min 0  [get_ports {image[6]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[5]}]
set_input_delay -clock clk  -min 0  [get_ports {image[5]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[4]}]
set_input_delay -clock clk  -min 0  [get_ports {image[4]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[3]}]
set_input_delay -clock clk  -min 0  [get_ports {image[3]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[2]}]
set_input_delay -clock clk  -min 0  [get_ports {image[2]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[1]}]
set_input_delay -clock clk  -min 0  [get_ports {image[1]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image[0]}]
set_input_delay -clock clk  -min 0  [get_ports {image[0]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[7]}]
set_input_delay -clock clk  -min 0  [get_ports {template[7]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[6]}]
set_input_delay -clock clk  -min 0  [get_ports {template[6]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[5]}]
set_input_delay -clock clk  -min 0  [get_ports {template[5]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[4]}]
set_input_delay -clock clk  -min 0  [get_ports {template[4]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[3]}]
set_input_delay -clock clk  -min 0  [get_ports {template[3]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[2]}]
set_input_delay -clock clk  -min 0  [get_ports {template[2]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[1]}]
set_input_delay -clock clk  -min 0  [get_ports {template[1]}]
set_input_delay -clock clk  -max 5.65  [get_ports {template[0]}]
set_input_delay -clock clk  -min 0  [get_ports {template[0]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image_size[1]}]
set_input_delay -clock clk  -min 0  [get_ports {image_size[1]}]
set_input_delay -clock clk  -max 5.65  [get_ports {image_size[0]}]
set_input_delay -clock clk  -min 0  [get_ports {image_size[0]}]
set_input_delay -clock clk  -max 5.65  [get_ports {action[2]}]
set_input_delay -clock clk  -min 0  [get_ports {action[2]}]
set_input_delay -clock clk  -max 5.65  [get_ports {action[1]}]
set_input_delay -clock clk  -min 0  [get_ports {action[1]}]
set_input_delay -clock clk  -max 5.65  [get_ports {action[0]}]
set_input_delay -clock clk  -min 0  [get_ports {action[0]}]
set_output_delay -clock clk  -max 5.65  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 5.65  [get_ports out_value]
set_output_delay -clock clk  -min 0  [get_ports out_value]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports in_valid2]
set_input_transition -min 0.5  [get_ports in_valid2]
set_input_transition -max 0.5  [get_ports {image[7]}]
set_input_transition -min 0.5  [get_ports {image[7]}]
set_input_transition -max 0.5  [get_ports {image[6]}]
set_input_transition -min 0.5  [get_ports {image[6]}]
set_input_transition -max 0.5  [get_ports {image[5]}]
set_input_transition -min 0.5  [get_ports {image[5]}]
set_input_transition -max 0.5  [get_ports {image[4]}]
set_input_transition -min 0.5  [get_ports {image[4]}]
set_input_transition -max 0.5  [get_ports {image[3]}]
set_input_transition -min 0.5  [get_ports {image[3]}]
set_input_transition -max 0.5  [get_ports {image[2]}]
set_input_transition -min 0.5  [get_ports {image[2]}]
set_input_transition -max 0.5  [get_ports {image[1]}]
set_input_transition -min 0.5  [get_ports {image[1]}]
set_input_transition -max 0.5  [get_ports {image[0]}]
set_input_transition -min 0.5  [get_ports {image[0]}]
set_input_transition -max 0.5  [get_ports {template[7]}]
set_input_transition -min 0.5  [get_ports {template[7]}]
set_input_transition -max 0.5  [get_ports {template[6]}]
set_input_transition -min 0.5  [get_ports {template[6]}]
set_input_transition -max 0.5  [get_ports {template[5]}]
set_input_transition -min 0.5  [get_ports {template[5]}]
set_input_transition -max 0.5  [get_ports {template[4]}]
set_input_transition -min 0.5  [get_ports {template[4]}]
set_input_transition -max 0.5  [get_ports {template[3]}]
set_input_transition -min 0.5  [get_ports {template[3]}]
set_input_transition -max 0.5  [get_ports {template[2]}]
set_input_transition -min 0.5  [get_ports {template[2]}]
set_input_transition -max 0.5  [get_ports {template[1]}]
set_input_transition -min 0.5  [get_ports {template[1]}]
set_input_transition -max 0.5  [get_ports {template[0]}]
set_input_transition -min 0.5  [get_ports {template[0]}]
set_input_transition -max 0.5  [get_ports {image_size[1]}]
set_input_transition -min 0.5  [get_ports {image_size[1]}]
set_input_transition -max 0.5  [get_ports {image_size[0]}]
set_input_transition -min 0.5  [get_ports {image_size[0]}]
set_input_transition -max 0.5  [get_ports {action[2]}]
set_input_transition -min 0.5  [get_ports {action[2]}]
set_input_transition -max 0.5  [get_ports {action[1]}]
set_input_transition -min 0.5  [get_ports {action[1]}]
set_input_transition -max 0.5  [get_ports {action[0]}]
set_input_transition -min 0.5  [get_ports {action[0]}]
